{
  "<pad>": 0,
  "<start>": 1,
  "<end>": 2,
  "<unk>": 3,
  "#": 4,
  "%10": 5,
  "%11": 6,
  "(": 7,
  ")": 8,
  "-": 9,
  "/": 10,
  "1": 11,
  "2": 12,
  "3": 13,
  "4": 14,
  "5": 15,
  "6": 16,
  "7": 17,
  "8": 18,
  "9": 19,
  "=": 20,
  "B": 21,
  "Br": 22,
  "C": 23,
  "Cl": 24,
  "F": 25,
  "I": 26,
  "N": 27,
  "O": 28,
  "P": 29,
  "S": 30,
  "[102Tc]": 31,
  "[105Mo]": 32,
  "[10B-]": 33,
  "[118Pd]": 34,
  "[11C-]": 35,
  "[11CH2]": 36,
  "[11CH3]": 37,
  "[11CH]": 38,
  "[11C]": 39,
  "[121Sb]": 40,
  "[122I]": 41,
  "[122SbH3]": 42,
  "[123I]": 43,
  "[124I]": 44,
  "[125I]": 45,
  "[125In]": 46,
  "[12CH3]": 47,
  "[12C]": 48,
  "[12cH]": 49,
  "[12c]": 50,
  "[130Sn]": 51,
  "[131IH]": 52,
  "[131I]": 53,
  "[132Te]": 54,
  "[137Sb]": 55,
  "[138Pm]": 56,
  "[139Sb]": 57,
  "[13C+]": 58,
  "[13C@@H]": 59,
  "[13C@@]": 60,
  "[13C@H]": 61,
  "[13C@]": 62,
  "[13CH2]": 63,
  "[13CH3]": 64,
  "[13CH]": 65,
  "[13C]": 66,
  "[13cH]": 67,
  "[13c]": 68,
  "[144Nd]": 69,
  "[144Sm]": 70,
  "[14C@@H]": 71,
  "[14C@H]": 72,
  "[14CH2]": 73,
  "[14CH3]": 74,
  "[14CH]": 75,
  "[14C]": 76,
  "[14cH]": 77,
  "[14c]": 78,
  "[159Sm]": 79,
  "[15N+]": 80,
  "[15NH2]": 81,
  "[15NH3+]": 82,
  "[15NH]": 83,
  "[15N]": 84,
  "[15nH]": 85,
  "[15n]": 86,
  "[160Tb]": 87,
  "[161Lu]": 88,
  "[16NH]": 89,
  "[16OH]": 90,
  "[173Hf]": 91,
  "[180Pb]": 92,
  "[189Pt]": 93,
  "[18FH]": 94,
  "[18F]": 95,
  "[18OH]": 96,
  "[18O]": 97,
  "[19C]": 98,
  "[19F]": 99,
  "[1H]": 100,
  "[210Bi]": 101,
  "[211At]": 102,
  "[233Np]": 103,
  "[244Cm]": 104,
  "[246Am]": 105,
  "[252Md]": 106,
  "[255Cf]": 107,
  "[27Al+3]": 108,
  "[28PH3]": 109,
  "[2H]": 110,
  "[34S]": 111,
  "[38Cl-]": 112,
  "[39ClH]": 113,
  "[3H]": 114,
  "[43SH2]": 115,
  "[48Mn]": 116,
  "[49Cr]": 117,
  "[66Mn]": 118,
  "[76Br]": 119,
  "[76Kr]": 120,
  "[77Br]": 121,
  "[82Se+4]": 122,
  "[83Mo]": 123,
  "[90Zr+4]": 124,
  "[92Pd]": 125,
  "[93Sr]": 126,
  "[Al+2]": 127,
  "[Al+]": 128,
  "[Al-]": 129,
  "[AlH2]": 130,
  "[AlH]": 131,
  "[Al]": 132,
  "[As+]": 133,
  "[AsH2]": 134,
  "[AsH]": 135,
  "[As]": 136,
  "[At]": 137,
  "[B-]": 138,
  "[B@@-]": 139,
  "[BH-]": 140,
  "[BH2-]": 141,
  "[BH3-]": 142,
  "[B]": 143,
  "[Ba]": 144,
  "[Bi+]": 145,
  "[BiH2]": 146,
  "[BiH]": 147,
  "[Bi]": 148,
  "[Br+2]": 149,
  "[Br+]": 150,
  "[Br]": 151,
  "[C+]": 152,
  "[C-]": 153,
  "[C@@H]": 154,
  "[C@@]": 155,
  "[C@H]": 156,
  "[C@]": 157,
  "[CH+]": 158,
  "[CH-]": 159,
  "[CH2+]": 160,
  "[CH2-]": 161,
  "[CH2]": 162,
  "[CH3]": 163,
  "[CH]": 164,
  "[C]": 165,
  "[Ca]": 166,
  "[Ce]": 167,
  "[Cl+2]": 168,
  "[Cl+3]": 169,
  "[Cl+]": 170,
  "[ClH+]": 171,
  "[Cl]": 172,
  "[Co]": 173,
  "[Cr]": 174,
  "[Cu+]": 175,
  "[Cu]": 176,
  "[Er]": 177,
  "[F]": 178,
  "[Fe+]": 179,
  "[Fe]": 180,
  "[Ga-]": 181,
  "[GaH2]": 182,
  "[GaH]": 183,
  "[Ga]": 184,
  "[GeH2]": 185,
  "[GeH3]": 186,
  "[GeH]": 187,
  "[Ge]": 188,
  "[Hg+]": 189,
  "[Hg-2]": 190,
  "[Hg]": 191,
  "[I+2]": 192,
  "[I+3]": 193,
  "[I+]": 194,
  "[I-]": 195,
  "[IH+]": 196,
  "[I]": 197,
  "[InH2]": 198,
  "[InH]": 199,
  "[In]": 200,
  "[Ir+2]": 201,
  "[K]": 202,
  "[Li]": 203,
  "[Mg+]": 204,
  "[Mg]": 205,
  "[Mn+]": 206,
  "[Mn]": 207,
  "[Mo+]": 208,
  "[Mo]": 209,
  "[N+]": 210,
  "[N-]": 211,
  "[N@+]": 212,
  "[N@@+]": 213,
  "[NH+]": 214,
  "[NH-]": 215,
  "[NH2+]": 216,
  "[NH2]": 217,
  "[NH3+]": 218,
  "[NH]": 219,
  "[N]": 220,
  "[Na]": 221,
  "[Nb-2]": 222,
  "[Nb]": 223,
  "[Ni]": 224,
  "[O+]": 225,
  "[O-]": 226,
  "[OH+]": 227,
  "[OH2+]": 228,
  "[OH]": 229,
  "[O]": 230,
  "[Os]": 231,
  "[P+]": 232,
  "[P-]": 233,
  "[P@@]": 234,
  "[P@H]": 235,
  "[P@]": 236,
  "[PH+]": 237,
  "[PH-]": 238,
  "[PH2+]": 239,
  "[PH3+]": 240,
  "[PH]": 241,
  "[P]": 242,
  "[PbH]": 243,
  "[Pb]": 244,
  "[Pd]": 245,
  "[PoH]": 246,
  "[Po]": 247,
  "[Pt+2]": 248,
  "[Pt+4]": 249,
  "[Pt]": 250,
  "[Rb]": 251,
  "[Re]": 252,
  "[Rh+2]": 253,
  "[Rh-]": 254,
  "[Rh]": 255,
  "[Ru+]": 256,
  "[Ru-]": 257,
  "[RuH]": 258,
  "[Ru]": 259,
  "[S+]": 260,
  "[S-]": 261,
  "[S@@]": 262,
  "[S@]": 263,
  "[SH+]": 264,
  "[SH2+]": 265,
  "[S]": 266,
  "[Sb-]": 267,
  "[SbH2]": 268,
  "[SbH]": 269,
  "[Sb]": 270,
  "[Se+]": 271,
  "[Se-]": 272,
  "[SeH]": 273,
  "[Se]": 274,
  "[Si+2]": 275,
  "[Si+]": 276,
  "[Si-]": 277,
  "[Si@@H]": 278,
  "[Si@@]": 279,
  "[Si@H]": 280,
  "[Si@]": 281,
  "[SiH+]": 282,
  "[SiH-]": 283,
  "[SiH2]": 284,
  "[SiH3-]": 285,
  "[SiH3]": 286,
  "[SiH]": 287,
  "[Si]": 288,
  "[Sn+2]": 289,
  "[Sn+3]": 290,
  "[Sn+]": 291,
  "[Sn-]": 292,
  "[SnH2]": 293,
  "[SnH3]": 294,
  "[SnH]": 295,
  "[Sn]": 296,
  "[Ta]": 297,
  "[Tc+4]": 298,
  "[Te+]": 299,
  "[TeH]": 300,
  "[Te]": 301,
  "[Ti-]": 302,
  "[Ti]": 303,
  "[TlH]": 304,
  "[Tl]": 305,
  "[V]": 306,
  "[W]": 307,
  "[Xe]": 308,
  "[Yb]": 309,
  "[Zr+2]": 310,
  "[Zr]": 311,
  "[b-]": 312,
  "[c+]": 313,
  "[c-]": 314,
  "[cH-]": 315,
  "[c]": 316,
  "[n+]": 317,
  "[n-]": 318,
  "[nH+]": 319,
  "[nH]": 320,
  "[n]": 321,
  "[o+]": 322,
  "[oH+]": 323,
  "[p+]": 324,
  "[p-]": 325,
  "[pH]": 326,
  "[s+]": 327,
  "[sH+]": 328,
  "[se+]": 329,
  "[se]": 330,
  "[siH]": 331,
  "[si]": 332,
  "[te]": 333,
  "\\": 334,
  "b": 335,
  "c": 336,
  "n": 337,
  "o": 338,
  "p": 339,
  "s": 340
}